travel/app/controllers/destinations_controller.rb

  def index
    if params[:country] == nil
        @destinations = Destination.all
    else
        @destinations = Destination.where(country: params[:country].titleize)
    end

    @my_countries = Destination.select(:country).order(:country).distinct
---
SELECT "destinations".* FROM "destinations"
SELECT "destinations".* FROM "destinations" WHERE "destinations"."country" = ?  [["country", "New Zealand"]]
SELECT DISTINCT "destinations"."country" FROM "destinations"  ORDER BY "destinations"."country" ASC

  def create
    @destination = Destination.new(destination_params)

    respond_to do |format|
      if @destination.save
---
INSERT INTO "destinations" ("city", "country", "description", "population", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city", "Toyko"], ["country", "Japan"], ["description", ""], ["population", 100000000], ["created_at", "2015-05-13 02:57:04.179656"], ["updated_at", "2015-05-13 02:57:04.179656"]]

  def update
    respond_to do |format|
      if @destination.update(destination_params)
---
UPDATE "destinations" SET "city" = ?, "latitude" = ?, "longitude" = ?, "address" = ?, "updated_at" = ? WHERE "destinations"."id" = ?  [["city", "Kobe"], ["latitude", 34.6951242], ["longitude", 135.1978525], ["address", "Chuo Ward, Kobe, Hyogo Prefecture"], ["updated_at", "2015-06-01 21:59:06.962850"], ["id", 1]]

  def destroy
    @destination.destroy
---
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 2]]

    def set_destination
      @destination = Destination.find(params[:id])
---
SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT 1  [["id", 2]]