Top_5/app/views/artists/show.html.erb


            <% @artist.songs.each do |song| %>
            <div class="well well-sm">
            <% if song.artist.avatar.exists? != nil %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]