KChirp/app/controllers/chirps_controller.rb

SELECT "chirps".* FROM "chirps"
---
    def index
        @chirps = Chirp.all

INSERT INTO "chirps" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Need a lot of caffeine!!"], ["user_id", 1], ["created_at", "2015-05-26 14:53:39.096396"], ["updated_at", "2015-05-26 14:53:39.096396"]]
---
    def create
        @chirp = Chirp.new(chirp_params)
        @users = User.all

        respond_to do |format|
            if @chirp.save

UPDATE "chirps" SET "user_id" = ?, "updated_at" = ? WHERE "chirps"."id" = ?  [["user_id", 4], ["updated_at", "2015-05-28 01:48:56.672549"], ["id", 2]]
---
    def update
        respond_to do |format|
            if @chirp.update(chirp_params)

SELECT  "chirps".* FROM "chirps" WHERE "chirps"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_chirp
        @chirp = Chirp.find(params[:id])