KChirp/app/controllers/epicenter_controller.rb

    def feed
        # Here we initialize the array that will
        # hold chirps from the current_user's
        # following list.
        @following_chirps = []

        # We pull in all the tweets . . .
        @chirps = Chirp.all

        # Then we sort through the tweets
        # to find ones associated with
        # users from the current_users
        #following array.

        @users = User.all
---
SELECT "chirps".* FROM "chirps"
SELECT "users".* FROM "users"