Top_5/app/views/rock/roll.html.erb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
    <div class="well well-sm">
        <% if song.artist.avatar.exists? != nil %>