Top_5/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Aerosmith"], ["created_at", "2015-05-26 04:13:26.870605"], ["updated_at", "2015-05-26 04:13:26.870605"]]
---
    def create
        @artist = Artist.new(artist_params)

        respond_to do |format|
            if @artist.save