Top_5/app/controllers/rock_controller.rb

SELECT  "songs".* FROM "songs"  ORDER BY "songs"."rating" DESC LIMIT 5
---
    def roll
        @songs = Song.order(rating: :desc).limit(5)