Top_5/app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
    def new
        @song = Song.new
        @artists = Artist.all

SELECT "artists".* FROM "artists"
---
    def edit
        @artists = Artist.all

INSERT INTO "songs" ("name", "rating", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Dulcimer Stomp"], ["rating", 4], ["artist_id", 1], ["created_at", "2015-05-26 04:14:06.120620"], ["updated_at", "2015-05-26 04:14:06.120620"]]
---
    def create
        @song = Song.new(song_params)
        @artists = Artist.all

        respond_to do |format|
            if @song.save