todo_list/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "1st rebuild of app due to SQL error"], ["deadline", "2015-05-28 14:50:00.000000"], ["created_at", "2015-05-28 14:50:41.234913"], ["updated_at", "2015-05-28 14:50:41.234913"]]
---
    def create
        #@task = Task.new(task_params)
        @task  = Task.create(task_params)