blogkelly/app/controllers/blog_posts_controller.rb

    def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
        if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "author", "blog_entry", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
    respond_to do |format|
        if @blog_post.update(blog_post_params)
---
UPDATE "blog_posts" SET "blog_entry" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?