blogkelly/app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "comment_entry", "blog_post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Tim"], ["comment_entry", "Great!"], ["blog_post_id", 5], ["created_at", "2015-05-20 17:40:49.986396"], ["updated_at", "2015-05-20 17:40:49.986396"]]
---
    def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
        if @comment.save