project/app/views/statuses/index.html.erb

SELECT "statuses".* FROM "statuses"
---
<div class="page-header">    <!-- above adds line under the below header for aethetics.  !-->    <h1>All of the Statuses</h1></div><%= link_to "Post a New Status", new_status_path, class: "btn btn-success" %><!-- Adding the class: "btn" will make this a button.  Adding the class: "btn btn-success" adds a button and the btn-success adds the color green to the button. !--><% @statuses.each do |status| %><div class="status">    <strong><%= status.name %></strong><p><%=status.content %></p>    <div class="meta">        <%= link_to time_ago_in_words(status.created_at) + " ago", status %>         <span class="admin">        <%=link_to "Edit", edit_status_path(status) %> |        <%=link_to "Delete", status, method: :delete, data: {confirm: "Are you sure you want to delete this status?"} %>        </span>    </div>    </div><% end %>