KChirp/app/views/epicenter/feed.html.erb

                    <span class="small-text">CHIRPS</span><br />
                    <%= current_user.chirps.count %>
---
SELECT "chirps".* FROM "chirps"
SELECT COUNT(*) FROM "chirps" WHERE "chirps"."user_id" = ?  [["user_id", 1]]